app/controllers/items_controller.rb

INSERT INTO "items" ("name", "done", "todo_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Listen to the Symphony"], ["done", false], ["todo_id", 2], ["created_at", "2021-03-25 20:37:23.639287"], ["updated_at", "2021-03-25 20:37:23.639287"]]
---
  def create
    @todo.items.create!(item_params)

UPDATE "items" SET "done" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["done", true], ["updated_at", "2021-03-25 20:43:32.257546"], ["id", 1]]
---
  def update
    @item.update(item_params)

SELECT "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def set_todo
    @todo = Todo.find(params[:todo_id])

SELECT "items".* FROM "items" WHERE "items"."todo_id" = $1 AND "items"."id" = $2 LIMIT $3  [["todo_id", 2], ["id", 1], ["LIMIT", 1]]
---
  def set_todo_item
    @item = @todo.items.find_by!(id: params[:id]) if @todo