app/controllers/todos_controller.rb

INSERT INTO "todos" ("title", "created_by", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Mozart"], ["created_by", "1"], ["created_at", "2021-03-25 19:15:46.286098"], ["updated_at", "2021-03-25 19:15:46.286098"]]
---
  def create
    # create todos belonging to current user
    @todo = current_user.todos.create!(todo_params)

UPDATE "todos" SET "title" = $1, "updated_at" = $2 WHERE "todos"."id" = $3  [["title", "Beethoven"], ["updated_at", "2021-03-25 19:30:40.011233"], ["id", 1]]
---
  def update
    @todo.update(todo_params)

DELETE FROM "todos" WHERE "todos"."id" = $1  [["id", 1]]
---
  def destroy
    @todo.destroy

SELECT "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_todo
    @todo = Todo.find(params[:id])